<?php

use Illuminate\Database\Seeder;

class RegionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      DB::table('regions')->insert(array(
        array('id' => '3160','name' => 'Алтайский край'),
        array('id' => '3223','name' => 'Амурская обл.'),
        array('id' => '3251','name' => 'Архангельская обл.'),
        array('id' => '3282','name' => 'Астраханская обл.'),
        array('id' => '3296','name' => 'Башкортостан(Башкирия)'),
        array('id' => '3352','name' => 'Белгородская обл.'),
        array('id' => '3371','name' => 'Брянская обл.'),
        array('id' => '3407','name' => 'Бурятия'),
        array('id' => '3437','name' => 'Владимирская обл.'),
        array('id' => '3468','name' => 'Волгоградская обл.'),
        array('id' => '3503','name' => 'Вологодская обл.'),
        array('id' => '3529','name' => 'Воронежская обл.'),
        array('id' => '3563','name' => 'Нижегородская (Горьковская)'),
        array('id' => '3630','name' => 'Дагестан'),
        array('id' => '3673','name' => 'Еврейская обл.'),
        array('id' => '3675','name' => 'Ивановская обл.'),
        array('id' => '3703','name' => 'Иркутская обл.'),
        array('id' => '3751','name' => 'Кабардино-Балкария'),
        array('id' => '3761','name' => 'Калининградская обл.'),
        array('id' => '3784','name' => 'Тверская обл.'),
        array('id' => '3827','name' => 'Калмыкия'),
        array('id' => '3841','name' => 'Калужская обл.'),
        array('id' => '3872','name' => 'Камчатская обл.'),
        array('id' => '3892','name' => 'Карелия'),
        array('id' => '3921','name' => 'Кемеровская обл.'),
        array('id' => '3952','name' => 'Кировская обл.'),
        array('id' => '3994','name' => 'Коми'),
        array('id' => '4026','name' => 'Костромская обл.'),
        array('id' => '4052','name' => 'Краснодарский край'),
        array('id' => '4105','name' => 'Красноярский край'),
        array('id' => '4176','name' => 'Курганская обл.'),
        array('id' => '4198','name' => 'Курская обл.'),
        array('id' => '4227','name' => 'Липецкая обл.'),
        array('id' => '4243','name' => 'Магаданская обл.'),
        array('id' => '4270','name' => 'Марий Эл'),
        array('id' => '4287','name' => 'Мордовия'),
        array('id' => '4312','name' => 'Москва и Московская обл.'),
        array('id' => '4481','name' => 'Мурманская обл.'),
        array('id' => '4503','name' => 'Новгородская обл.'),
        array('id' => '4528','name' => 'Новосибирская обл.'),
        array('id' => '4561','name' => 'Омская обл.'),
        array('id' => '4593','name' => 'Оренбургская обл.'),
        array('id' => '4633','name' => 'Орловская обл.'),
        array('id' => '4657','name' => 'Пензенская обл.'),
        array('id' => '4689','name' => 'Пермская обл.'),
        array('id' => '4734','name' => 'Приморский край'),
        array('id' => '4773','name' => 'Псковская обл.'),
        array('id' => '4800','name' => 'Ростовская обл.'),
        array('id' => '4861','name' => 'Рязанская обл.'),
        array('id' => '4891','name' => 'Самарская обл.'),
        array('id' => '4925','name' => 'Санкт-Петербург и область'),
        array('id' => '4969','name' => 'Саратовская обл.'),
        array('id' => '5011','name' => 'Саха (Якутия)'),
        array('id' => '5052','name' => 'Сахалин'),
        array('id' => '5080','name' => 'Свердловская обл.'),
        array('id' => '5151','name' => 'Северная Осетия'),
        array('id' => '5161','name' => 'Смоленская обл.'),
        array('id' => '5191','name' => 'Ставропольский край'),
        array('id' => '5225','name' => 'Тамбовская обл.'),
        array('id' => '5246','name' => 'Татарстан'),
        array('id' => '5291','name' => 'Томская обл.'),
        array('id' => '5312','name' => 'Тува (Тувинская Респ.)'),
        array('id' => '5326','name' => 'Тульская обл.'),
        array('id' => '5356','name' => 'Тюменская обл.'),
        array('id' => '5404','name' => 'Удмуртия'),
        array('id' => '5432','name' => 'Ульяновская обл.'),
        array('id' => '5458','name' => 'Уральская обл.'),
        array('id' => '5473','name' => 'Хабаровский край'),
        array('id' => '5507','name' => 'Челябинская обл.'),
        array('id' => '5543','name' => 'Чечено-Ингушетия'),
        array('id' => '5555','name' => 'Читинская обл.'),
        array('id' => '5600','name' => 'Чувашия'),
        array('id' => '5625','name' => 'Ярославская обл.'),
        array('id' => '1998532','name' => 'Адыгея'),
        array('id' => '2316497','name' => 'Хакасия'),
        array('id' => '2415585','name' => 'Чукотский АО'),
        array('id' => '2499002','name' => 'Ханты-Мансийский АО'),
        array('id' => '5019394','name' => 'Ямало-Ненецкий АО')
      )
);
    }
}
